/* By https://github.com/DIEGO-OFC/DORRAT-BOT-MD */

const handler = async (m, {conn, text}) => {
  m.reply(`*╔═══════════════════════════*\n➢ *"${pickRandom(global.piropo)}"*\n*╚═══════════════════════════*`);
};
handler.tags = ['frases'];
handler.command = ['piropo'];
export default handler;

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())];
}

global.piropo = ['أود أن أكون ورقًا حتى أتمكن من تغليف تلك الشوكولاتة.', 'أنت مثل شبكة wifi بدون كلمة مرور، الجميع يبحث عنك', 'من كان حافلة تسير في منحنيات قلبك.', 'أريد أن أطير بلا أجنحة وأغادر هذا الكون، وأدخل عالمك وأحبك في صمت..', 'أود أن أكون زبدة تذوب في أريبا الخاص بك.', 'لو كان الجمال خطيئة لكنت بالفعل في الجحيم.', 'أود أن أكون قطة لأقضي 7 أرواح بجانبك.', 'السرقة خطأ ولكن قبلة من فمك ستسرقها مني.', 'كم تكون السماء جميلة عندما تكون صافية ولكن الحب يكون أجمل عندما تكون بجانبي.', 'جميلة، تمشي في الظل، الشمس تذيب الشوكولاتة.', 'إذا كان بريدًا إلكترونيًا، فستكون كلمة المرور الخاصة بي.', 'أود أن تكون جبلاً لأعطيك المنجل', 'لقد فقدت رقم هاتفي، هل يمكنك أن تعطيني رقمك؟?', 'ما هو اسمك لتطلب من سانتا كلوز هدية؟?', ' هناك العديد من النجوم في السماء، لكن ألمعها موجود على الأرض، وهو أنت..', 'هل أشرقت الشمس للتو أم أنها الابتسامة التي أعطيتني إياها اليوم?', 'إنه ليس الروم أو البيرة، أنت من ذهب إلى رأسي', 'إذا تحدثنا عن الرياضيات فأنت مجموع كل رغباتي.', 'أنت تبدو مثل Google لأن لديك كل ما أبحث عنه.', 'قهوتي المفضلة هي تلك التي بعينيك.', 'أريد أن أكون فوتوشوب لتنقيح جسمك بالكامل.', 'أتمنى لو كنت حبوبًا لتتناولها بالملعقة في الصباح.', 'ومن كان جائعا فليعطيه ثلاث مرات في اليوم.'];
